VPro/src/ExchangePlans/MobileApplications/MobileApplications.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="45b8ca55-cf30-4d59-8e0c-ff394374dfce">
  <name>MobileApplications</name>
  <attributes>
    <name>Profile</name>
    <type>
      <types>EnumRef.MobileApplicationProfiles</types>
    </type>
  </attributes>
  <attributes>
    <name>MobileAppVersion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ByResponsible</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubscriberID</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxСalendar</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DateLastSync</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessIsDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPoint</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>CashRegister</name>
    <type>
      <types>CatalogRef.CashRegisters</types>
    </type>
  </attributes>
  <attributes>
    <name>ForAllCashRegisters</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>EnumRef.RolesOfMobileApplication</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

VPro/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <attributes>
    <name>NotValid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Service</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Prepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InfobaseUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceUserID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>InfobaseUserProperties</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/ExchangePlans/MobileApplications/Forms/ListForm/Module.bsl
&AtClient
Procedure Connect(Command)
	
	Notification = New NotifyDescription("AfterChoosingFromMenu", ThisObject);
	UsersList = GetUsersList();
	
	If UsersList.Count() > 1 Then
		ShowChooseFromMenu(Notification, UsersList);
	Else
		OpenForm("ExchangePlan.MobileApplications.Form.ConnectionForm");
	EndIf;
	
EndProcedure

&AtClient
Procedure AfterChoosingFromMenu(SelectedItem, Parameters) Export
	
	If SelectedItem <> Undefined AND ValueIsFilled(SelectedItem.Value) Then
		OpenForm("ExchangePlan.MobileApplications.Form.ConnectionForm", New Structure("User", SelectedItem.Value));
	EndIf;

EndProcedure

&AtServer
Function GetUsersList()
	
	SetPrivilegedMode(True);
	
	UsersList = New ValueList();
	
	Selection = Catalogs.Users.Select();
	
	While Selection.Next() Do
		If Selection.Description <> "<No set>"
			AND NOT Selection.Service
			AND NOT Selection.NotValid Then
			
			UserParameters = InfoBaseUsers.FindByUUID(Selection.InfobaseUserID);
			
			If UserParameters <> Undefined Then
				Login = UserParameters.Name;
				UsersList.Add(Login, Login,,PictureLib.User);
			EndIf;
		EndIf;
	EndDo;
	
	SetPrivilegedMode(False);
	
	Return UsersList;
	
EndFunction

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "CustomizeMobileApplicationsReady" Then
		Items.List.Refresh();
	EndIf;
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Items.List.ChoiceMode = Parameters.ChoiceMode;
	
EndProcedure
